export const imageDataConfig = {
  // 第 01 势   起势
  'bafawubu/103821.jpg': {
    desc: '1. 并步站立（从头到脚检查一遍，与八段锦预备式相同）',
    block: '第 01 势   起势',
  },
  'bafawubu/103831.jpg': { desc: '2. 左脚开步' },
  'bafawubu/103834.jpg': { desc: '3. 两手内旋，掌心向后' },
  'bafawubu/103929.jpg': { desc: '4. 两手平举，与肩同宽，与肩同高' },
  'bafawubu/103937.jpg': { desc: '5. 屈膝下蹲，两手在膝的上方' },

  // 第 02 势   左掤
  'bafawubu/103945.jpg': {
    desc: '1. 右转抱球（右前方 45 度，两手掤圆）',
    block: ' 第 02 势   左掤',
  },
  'bafawubu/103953.jpg': {
    desc: '2. 左转前掤（正前方，左手在胸前，掌心朝内。右手在跨旁，掌心朝下）',
  },

  // 第 03 势   右捋
  'bafawubu/104000.jpg': {
    desc: '1. 左转摆手（左前方 45 度，左手掌心朝下。右手在左肘下方，掌心朝上）',
    block: '第 03 势   右捋',
  },
  'bafawubu/104006.jpg': { desc: '2.右转下捋（右手在跨旁，左手在腹前中线）' },

  // 第 04 势   左挤
  'bafawubu/104012.jpg': {
    desc: '1. 右转摆手（左手在右肩前，掌心朝下。右手在身体右侧，掌心朝上）',
    block: '第 04 势   左挤',
  },
  'bafawubu/104018.jpg': { desc: '2.左转搭手（正前方，左手掌心朝内。右手搭在左手手腕处）' },
  'bafawubu/104022.jpg': { desc: '3. 前挤后撑' },

  // 第 05 势   双按
  'bafawubu/104031.jpg': { desc: '1. 左手翻掌，右手穿掌', block: '第 05 势   双按' },
  'bafawubu/104035.jpg': { desc: '2. 两手分开，与肩同宽，与肩同高' },
  'bafawubu/104039.jpg': { desc: '3. 胸腰略右转，双手收回至胸前' },
  'bafawubu/104043.jpg': { desc: '4. 下按上领' },
  'bafawubu/104129.jpg': { desc: '5. 胸腰略左转，双手收回至胸前' },
  'bafawubu/104135.jpg': { desc: '6. 前推后撑' },

  // 第 06 势   右採
  'bafawubu/104143.jpg': { desc: '1. 左转握拳', block: '第 06 势   右採' },
  'bafawubu/104148.jpg': { desc: '2. 右转下採' },

  // 第 07 势   左挒
  'bafawubu/104154.jpg': { desc: '1. 右转摆手（左手斜朝下，右手朝上）', block: ' 第 07 势   左挒' },
  'bafawubu/104202.jpg': { desc: '2. 左转挒手（右手在正前方，掌心朝上，左手在身体左侧掤圆）' },

  // 第 08 势   左肘
  'bafawubu/104208.jpg': {
    desc: '1. 立掌握拳（右手立掌，拇指朝上。左手握拳）',
    block: '第 08 势   左肘',
  },
  'bafawubu/104215.jpg': { desc: '2. 左转滚肘（左手肘朝前，右手拇指朝上，贴于左拳上）' },

  // 第 09 势   右靠
  'bafawubu/104226.jpg': { desc: '1. 右手变拳，左手变掌', block: '第 09 势   右靠' },
  'bafawubu/104232.jpg': {
    desc: '2. 左转靠（右拳向下打，拳面朝下，在膝盖内侧。左手食指指向腋下）',
  },

  // 第 10 势   右掤
  'bafawubu/104243.jpg': {
    desc: '1. 左转抱球（左前方 45 度，两手掤圆）',
    block: '第 10 势   右掤',
  },
  'bafawubu/104250.jpg': {
    desc: '2. 右转前掤（正前方，右手在胸前，掌心朝内。左手在跨旁，掌心朝下）',
  },

  // 第 11 势   左捋
  'bafawubu/104256.jpg': {
    desc: '1. 右转摆手（右前方 45 度，右手掌心朝下。左手在右肘下方，掌心朝上）',
    block: '第 11 势   左捋',
  },
  'bafawubu/104302.jpg': { desc: '2. 左转下捋（左手在跨旁，右手在腹前中线）' },

  // 第 12 势   右挤
  'bafawubu/104308.jpg': {
    desc: '1. 左转摆手（右手在左肩前，掌心朝下。左手在身体右侧，掌心朝上）',
    block: '第 12 势   右挤',
  },
  'bafawubu/104314.jpg': { desc: '2. 右转搭手（正前方，右手掌心朝内。左手搭在右手手腕处）' },
  'bafawubu/104317.jpg': { desc: '3. 前挤后撑' },

  // 第 13 势   双按
  'bafawubu/104322.jpg': { desc: '1. 右手翻掌，左手穿掌', block: '第 13 势   双按' },
  'bafawubu/104326.jpg': { desc: '2. 两手分开，与肩同宽，与肩同高' },
  'bafawubu/104331.jpg': { desc: '3. 胸腰略左转，双手收回至胸前' },
  'bafawubu/104344.jpg': { desc: '4. 下按上领' },
  'bafawubu/104348.jpg': { desc: '5. 胸腰略右转，双手收回至胸前' },
  'bafawubu/104355.jpg': { desc: '6. 前推后撑' },

  // 第 14 势   左採
  'bafawubu/104405.jpg': { desc: '1. 右转握拳', block: '第 14 势   左採' },
  'bafawubu/104419.jpg': { desc: '2. 左转下採' },

  // 第 15 势   右挒
  'bafawubu/104430.jpg': { desc: '1. 左转摆手（右手斜朝下，左手朝上）', block: '第 15 势   右挒' },
  'bafawubu/104436.jpg': { desc: '2. 右转挒手（左手在正前方，掌心朝上，右手在身体左侧掤圆）' },

  // 第 16 势   右肘
  'bafawubu/104441.jpg': {
    desc: '1. 立掌握拳（左手立掌，拇指朝上。右手握拳）',
    block: '第 16 势   右肘',
  },
  'bafawubu/104445.jpg': { desc: '2. 右转滚肘（右手肘朝前，左手拇指朝上，贴于左拳上）' },

  // 第 17 势   左靠
  'bafawubu/104455.jpg': { desc: '1. 左手变拳，右手变掌', block: '第 17 势   左靠' },
  'bafawubu/104500.jpg': {
    desc: '2. 右转靠（左拳向下打，拳面朝下，在膝盖内侧。右手食指指向腋下）',
  },
};

export const videoDataConfig = {
  video01: {
    title: '1势~17势',
    shotInfo: '2020年06月02日 深圳市',
    index: 2,
  },
};
